import React from 'react'
import './style.scss';
const InfoCoup = (props) => {
  console.log("Это для информации", props);
  const area = {
    1: "Ворошиловском районе",
    2: "Киевском районе",
    3: "Калининском районе",
    4: "Куйбышевском районе",
    5: "Ленинском районе",
    6: "Кировском районе",
    7: "Петровском районе",
    8: "Буденовском районе",
    9:  "Пролетарском районе"
  }
  return (
    <div className="info-box">
      <div className="info-box__title">
        <h3>Шкаф - {props.items.title}</h3>
        <span>Находится в - {area[props.items.areaID]}</span>
      </div>
      <div className="info-box__content">
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
        <h3>Комплектация</h3>
      </div>
    </div>
  )
}

export default InfoCoup
